Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/c-api.tmx
Source language: en
Languages: pt

source: Abstract Objects Layer
pt: Camada de Objetos Abstratos

source: The functions in this chapter interact with Python objects regardless of their type, or with wide classes of object types (e.g. all numerical types, or all sequence types). When used on object types for which they do not apply, they will raise a Python exception.
pt: As funções neste capítulo interagem com objetos Python independentemente de seu tipo, ou com grandes classes de tipos objetos (por exemplo, todos os tipos numéricos, ou todos os tipos sequenciais). Quando usadas em tipos objetos incompatíveis, elas irão levantar uma exceção Python.

source: It is not possible to use these functions on objects that are not properly initialized, such as a list object that has been created by :cfunc:`PyList_New`, but whose items have not been set to some non-\ ``NULL`` value yet.
pt: Não é possível usar estas funções em objetos que não foram inicializados apropriadamente, tal qual um objeto list que foi criado por :cfunc:`PyList_New`, mas cujos itens não foram atribuídos a algum valor não-\ ``NULL`` ainda.

source: Allocating Objects on the Heap
pt: Alocando Objetos no Heap

source: See also
pt: Veja também

source: To allocate and create extension modules.
pt: Para alocar e criar módulos de extensão.

source: Parsing arguments and building values
pt: Analisando argumentos e construindo valores

source: Parsing arguments
pt: Analisando argumentos

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
pt: Uma string de formatação consiste de zero ou mais "unidades de formatação". Uma unidade de formatação descreve um objeto Python; ela é geralmente um único caractere ou uma sequência de unidades de formatação entre parênteses. Com algumas poucas exceções, uma unidade de formatação que não é uma sequência entre parênteses normalmente corresponde a um único argumento de endereço para essas funções. Na seguinte descrição, a forma entre aspas é a unidade de formatação; a entrada em parênteses (redondos) é o tipo de objeto Python que corresponde a unidade de formatação; e a entrada em colchetes (quadrados) é o tipo da(s) variável(is) C cujo endereço deve ser passado.

source: Strings and buffers
pt: Strings e buffers

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to *NULL*.
pt: Como``s``, mas o objeto Python também pode ser ``None``, caso em que o ponteiro C obtém o valor *NULL*.

source: There are two modes of operation:
pt: Existem dois modos de operação:

source: Numbers
pt: Números

source: Other objects
pt: Outros objetos

source: status = converter(object, address);
pt: status = converter(objeto, endereco);

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
pt: Alguns outros poucos caracteres têm um significado em uma string de formatação. Esses podem não ocorrer dentro de parênteses aninhados. Eles são:

source: API Functions
pt: Funções da API

source: Building values
pt: Construindo valores

source: Boolean Objects
pt: Objetos Booleanos

source: Buffer Objects
pt: Objetos de Buffer

source: Buffer related functions
pt: Funções relacionadas a buffers

source: Direct API functions
pt: Funções diretas da API

source: Capsules
pt: Cápsulas

source: Complex Numbers as C Structures
pt: Números Complexos como Estruturas C

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for *NULL* being passed instead of a valid object. Allowing *NULL* to be passed in can cause memory access violations and immediate termination of the interpreter.
pt: Enquanto as funções descritas neste capítulo cuidadosamente checam o tipo dos objetos passados, muitas delas não checam se *NULL* foi passado ao invés de um objeto válido. Permitir que *NULL* seja passado pode causar violações de acesso de memória e término imediato do interpretador.

source: Fundamental Objects
pt: Objetos Fundamentais

source: Numeric Objects
pt: Objetos Numéricos

source: Sequence Objects
pt: Objetos de Sequência

source: Other Objects
pt: Outros Objetos

source: String conversion and formatting
pt: Conversão e formatação de string

source: Macros to create objects:
pt: Macros para criar objetos:

source: Macros for the convenience of modules implementing the DB API:
pt: Macros para a conveniência de módulos implementando a API DB:

source: Dictionary Objects
pt: Objetos Dicionário

source: Exception Handling
pt: Tratamento de Exceções

source: Exception Objects
pt: Objetos Exceção

source: Recursion Control
pt: Controle de Recursividade

source: Standard Exceptions
pt: Exceções Padrão

source: C Name
pt: Nome C

source: Python Name
pt: Nome Python

source: Notes
pt: Notas

source: Notes:
pt: Notas:

source: This is a base class for other standard exceptions.
pt: Esta é uma classe base para outras exceções padrão

source: File Objects
pt: Objetos Arquivo

source: Floating Point Objects
pt: Objetos Ponto Flutuante

source: Function Objects
pt: Objetos Função

source: There are a few functions specific to Python functions.
pt: Existem algumas funções específicas para as funções Python.

source: Supporting Cyclic Garbage Collection
pt: Apoiando a Coleta de Lixo Cíclica

source: Generator Objects
pt: Objetos Gerador

source: Importing Modules
pt: Importando Módulos

source: Python/C API Reference Manual
pt: Manual de Referência à API Python/C

source: Release
pt: Lançamento

source: |version|
pt: |versão|

source: Date
pt: Data

source: |today|
pt: |hoje|

source: Initialization, Finalization, and Threads
pt: Inicialização, Finalização e Threads

source: Thread State and the Global Interpreter Lock
pt: Estado da Thread e a Trava do Interpretador Global

source: When thread support is enabled, the block above expands to the following code::
pt: Quando o suporte à threads está habilitado, o bloco acima é expandido para o seguinte código::

source: Introduction
pt: Introdução

source: C++ users should note that though the API is defined entirely using C, the header files do properly declare the entry points to be ``extern "C"``, so there is no need to do anything special to use the API from C++.
pt: Usuários de C++ devem observar que, apesar da API ser inteiramente definida em C, os arquivos de cabeçalho (header files) fazem uma declaração apropriada dos pontos de entrada como sendo ``extern "C"``, então não há necessidade de se fazer qualquer coisa especial para se fazer uso da API usando-se C++.

source: Types
pt: Tipos

source: Exceptions
pt: Exceções

source: Here is the corresponding C code, in all its glory::
pt: Aqui está o código C correspondente, em toda a sua glória:

source: List Objects
pt: Objetos Lista

source: Integer Objects
pt: Objetos Inteiro

source: Mapping Protocol
pt: Protocolo de Mapeamento

source: Numeric values are stored with the least significant byte first.
pt: Valores numéricos são armazenados com o byte menos significante primeiro.

source: Memory Management
pt: Gerenciamento de Memória

source: Overview
pt: Visão Geral

source: Memory Interface
pt: Interface da Memória

source: Examples
pt: Exemplos

source: Method Objects
pt: Objetos Método

source: Module Objects
pt: Objetos Módulo

source: There are only a few functions special to module objects.
pt: Existem apenas algumas funções especiais ao módulo de objetos.

source: Initializing C modules
pt: Inicializando módulos C

source: These functions are usually used in the module initialization function.
pt: Essas funções são normalmente utilizadas na função de inicialização do módulo.

source: The None Object
pt: O Objeto Nulo

source: Number Protocol
pt: Protocolo de Número

source: Buffer Protocol
pt: Protocolo de Buffer

source: Object Protocol
pt: Protocolo de Objeto

source: Reflection
pt: Reflexão

source: Sequence Protocol
pt: Protocolo de Sequência

source: Set Objects
pt: Objetos Conjunto

source: Operating System Utilities
pt: Utilitários do Sistema Operacional

source: System Functions
pt: Funções do Sistema

source: Process Control
pt: Controle de Processos

source: Tuple Objects
pt: Objetos Tupla

source: Type Objects
pt: Objetos Tipo

source: Unicode Objects and Codecs
pt: Objetos Unicode e Codecs

source: Unicode Objects
pt: Objetos Unicode

source: Unicode Type
pt: Tipo Unicode

source: Unicode Character Properties
pt: Propriedades do Caractere Unicode

source: File System Encoding
pt: Codificação do Sistema de Arquivos

source: Generic Codecs
pt: Codecs Genéricos

source: These are the generic codec APIs:
pt: Estas são as APIs de codec genéricas:

source: UTF-8 Codecs
pt: Codecs UTF-8

source: These are the UTF-8 codec APIs:
pt: Estas são as APIs do codec UTF-8:

source: UTF-32 Codecs
pt: Codecs UTF-32

source: These are the UTF-32 codec APIs:
pt: Estas são as APIs do codec UTF-32:

source: UTF-16 Codecs
pt: Codecs UTF-16

source: These are the UTF-16 codec APIs:
pt: Estas são as APIs do codec UTF-16:

source: Unicode-Escape Codecs
pt: Codecs Unicode-Escape

source: These are the "Unicode Escape" codec APIs:
pt: Estas são as APIs do codec "Unicode Escape":

source: Raw-Unicode-Escape Codecs
pt: Codecs Raw-Unicode-Escape

source: These are the "Raw Unicode Escape" codec APIs:
pt: Estas são as APIs do codec "Raw Unicode Escape":

source: Latin-1 Codecs
pt: Codecs Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
pt: Estas são as APIs do codec Latin-1: Latin-1 corresponde aos primeiros 256 ordinais Unicode e apenas estes são aceitos pelos codecs durante a codificação.

source: ASCII Codecs
pt: Codecs ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
pt: Estas são as APIs do codec ASCII: Apenas dados em ASCII 7-bit são aceitos. Todos os outros códigos geram erros.

source: Character Map Codecs
pt: Codecs Mapa de Caracteres

source: These are the mapping codec APIs:
pt: Estas são as APIs de mapeamento de codec:

source: MBCS codecs for Windows
pt: Codecs MBCS para Windows

source: They all return *NULL* or ``-1`` if an exception occurs.
pt: Todas elas retornam *NULL* ou ``-1`` se uma exceção ocorre.

source: Utilities
pt: Utilitários

source: Weak Reference Objects
pt: Objetos de Referências Fracas
